Wall Analytical Model has lost its adjustment reference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WallAMLostAdjustmentReference { get; }
  Visual Basic
Public Shared ReadOnly Property WallAMLostAdjustmentReference As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WallAMLostAdjustmentReference {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace